# Housing Project Nairobi

In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
combined = pd.read_csv('data/data_final/Combined_df.csv')
kenya_prop = pd.read_csv('data/data_final/Final_KenyaProperty.csv')
prop = pd.read_csv('data/data_final/Final_property24.csv')
prop24 = pd.read_csv('data/data_final/property24.csv')
rent_ke = pd.read_csv('data/data_final/rent_ke.csv')

In [3]:
combined.head()

        City        Location  Bedrooms  Bathrooms  Parking     Price
0  Westlands   Spring Valley         4          0      1.0    3000.0
1  Westlands  Westlands Area         2          2      1.0  150000.0
2  Westlands       Riverside         3          3      1.0  200000.0
3    Nairobi      Upper Hill         1          1      1.0  100000.0
4  Westlands       Brookside         4          3      1.0  120000.0

In [4]:
combined.tail()

          City        Location  Bedrooms  Bathrooms  Parking     Price
5258   Nairobi        Kilimani         3          3      NaN   75000.0
5259       NaN             NaN         3          2      NaN   45000.0
5260   Nairobi   Spring Valley         2          3      NaN   65000.0
5261   Nairobi        Muthaiga         4          5      NaN  300000.0
5262   Nairobi       Westlands         2          2      NaN  100000.0

In [5]:
combined.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5263 entries, 0 to 5262
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City       4887 non-null   object
 1   Location   4886 non-null   object
 2   Bedrooms   5263 non-null   int64
 3   Bathrooms  5263 non-null   int64
 4   Parking    2743 non-null   float64
 5   Price      5243 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 246.8+ KB

In [6]:
kenya_prop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1971 entries, 0 to 1970
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0    City      1525 non-null   object
 1   Location   1523 non-null   object
 2   Bedrooms   1883 non-null   float64
 3   Bathrooms  1830 non-null   float64
 4   Toilets    1707 non-null   float64
 5   Parking    1160 non-null   float64
 6   Price      1971 non-null   int64
dtypes: float64(4), int64(1), object(2)
memory usage: 107.9+ KB

In [7]:
kenya_prop['City'] = kenya_prop[' City']
kenya_prop.drop(kenya_prop[[' City']], axis=1, inplace=True)

In [8]:
kenya_prop.drop(kenya_prop[['Toilets']], axis=1,inplace=True)

In [9]:
prop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9980 entries, 0 to 9979
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City       9980 non-null   object
 1   Location   9980 non-null   object
 2   Bedrooms   9630 non-null   float64
 3   Bathrooms  9630 non-null   float64
 4   Toilets    9340 non-null   float64
 5   Price      9980 non-null   int64
dtypes: float64(3), int64(1), object(2)
memory usage: 467.9+ KB

In [10]:
prop.drop(prop[['Toilets']], axis=1,inplace=True)

In [11]:
prop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9980 entries, 0 to 9979
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City       9980 non-null   object
 1   Location   9980 non-null   object
 2   Bedrooms   9630 non-null   float64
 3   Bathrooms  9630 non-null   float64
 4   Price      9980 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 390.0+ KB

In [12]:
prop24.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211995 entries, 0 to 211994
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Location   188149 non-null  object
 1   City       188149 non-null  object
 2   Bedrooms   206572 non-null  float64
 3   Bathrooms  203646 non-null  float64
 4   Parking    103158 non-null  float64
 5   Price      211900 non-null  float64
dtypes: float64(4), object(2)
memory usage: 9.7+ MB

In [13]:
rent_ke.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1848 entries, 0 to 1847
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1848 non-null   int64
 1   Bedrooms   1845 non-null   float64
 2   Bathrooms  1557 non-null   float64
 3   City       1848 non-null   object
 4   Location   1848 non-null   object
dtypes: float64(2), int64(1), object(2)
memory usage: 72.3+ KB

In [14]:
new_data = pd.concat([combined, kenya_prop], axis=0)

In [15]:
new_data.head()

        City        Location  Bedrooms  Bathrooms  Parking     Price
0  Westlands   Spring Valley       4.0        0.0      1.0    3000.0
1  Westlands  Westlands Area       2.0        2.0      1.0  150000.0
2  Westlands       Riverside       3.0        3.0      1.0  200000.0
3    Nairobi      Upper Hill       1.0        1.0      1.0  100000.0
4  Westlands       Brookside       4.0        3.0      1.0  120000.0

In [16]:
order=['City', 'Location', 'Bedrooms', 'Bathrooms', 'Parking', 'Price']
order1 = ['City', 'Location', 'Bedrooms', 'Bathrooms', 'Price']
#order1.remove('Parking')

In [17]:
kenya_prop_ord = kenya_prop[order]
prop_ord = prop[order1]
prop24_ord =  prop24[order]
rent_ke_ord = rent_ke[order1]

In [18]:
new_data = pd.concat([kenya_prop_ord, prop24_ord, combined, prop_ord, rent_ke_ord], axis=0)

In [19]:
new_data.head()

         City             Location  Bedrooms  Bathrooms  Parking     Price
0    Machakos   Syokimau/Mulolongo       4.0        4.0      NaN  100000.0
1   Westlands                Runda       3.0        3.0      2.0  180000.0
2     Nairobi        Spring Valley       5.0        5.0      4.0  380000.0
3     Nairobi            Thindigua       3.0        3.0      NaN   55000.0
4     Nairobi            Westlands       4.0        4.0      4.0  265000.0

In [20]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 231057 entries, 0 to 1847
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   City       206389 non-null  object
 1   Location   206386 non-null  object
 2   Bedrooms   225193 non-null  float64
 3   Bathrooms  221926 non-null  float64
 4   Parking    107061 non-null  float64
 5   Price      230942 non-null  float64
dtypes: float64(4), object(2)
memory usage: 12.3+ MB

In [21]:
new_data.shape

(231057, 6)

In [22]:
new_data.to_csv('housing_data.csv', index=False)

In [23]:
#from pandas_profiling import ProfileReport

In [24]:
#profile = ProfileReport(new_data)

In [25]:
#profile.to_notebook_iframe()